<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia Site Renderer 1.4 at 2013-09-19 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>TDD Exercise 6.3 - Persistence Layer (Data Access Objects)</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
      <meta name="author" content="Pedro Ballesteros pedro@theprogrammingchronicles.com" />
    <meta name="Date-Revision-yyyymmdd" content="20130919" />
    <meta http-equiv="Content-Language" content="en" />
                                                    
<meta content="no-cache, must-revalidate" http-equiv="Cache-Control"/>
                                                        
<meta content="nocache" http-equiv="Pragma"/>
                                                        
<meta content="-1" http-equiv="expires"/>
                                                        
<script type="text/javascript">var _gaq = _gaq || [];
              _gaq.push(['_setAccount', 'UA-21528789-5']);
              _gaq.push(['_trackPageview']);

              (function() {
                      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
                      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
                      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
              })();</script>
                      
        </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                TDD Exercise 6.3
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
            
                    
                <div class="xleft">
        <span id="publishDate">Last Published: 2013-09-19</span>
                  &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">        
                    
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
             
                    
                                <h5>Introducción</h5>
                  <ul>
                  <li class="none">
            <strong>Descripción</strong>
          </li>
                  <li class="none">
                          <a href="project-summary.html" title="Proyecto">Proyecto</a>
            </li>
                  <li class="none">
                          <a href="project-info.html" title="Información">Información</a>
            </li>
          </ul>
                       <h5>Parent Project</h5>
                  <ul>
                  <li class="none">
                          <a href="../index.html" title="TDD Lesson 6">TDD Lesson 6</a>
            </li>
          </ul>
                       <h5>Informes - Acceso rápido</h5>
                  <ul>
                  <li class="none">
                          <a href="surefire-report.html" title="Tests Unitarios">Tests Unitarios</a>
            </li>
                  <li class="none">
                          <a href="cobertura/index.html" title="Cobertura Tests">Cobertura Tests</a>
            </li>
                  <li class="none">
                          <a href="apidocs/index.html" title="Java Doc">Java Doc</a>
            </li>
                  <li class="none">
                          <a href="testapidocs/index.html" title="Test Java Doc">Test Java Doc</a>
            </li>
                  <li class="none">
                          <a href="xref/index.html" title="Source Code">Source Code</a>
            </li>
                  <li class="none">
                          <a href="xref-test/index.html" title="Tests Code">Tests Code</a>
            </li>
          </ul>
                                 <h5>Project Documentation</h5>
                  <ul>
                                                                                                                                                                                                                                                <li class="expanded">
                          <a href="project-info.html" title="Project Information">Project Information</a>
                    <ul>
                      <li class="none">
            <strong>About</strong>
          </li>
                      <li class="none">
                          <a href="project-summary.html" title="Project Summary">Project Summary</a>
            </li>
                      <li class="none">
                          <a href="team-list.html" title="Project Team">Project Team</a>
            </li>
                      <li class="none">
                          <a href="license.html" title="Project License">Project License</a>
            </li>
                      <li class="none">
                          <a href="dependencies.html" title="Dependencies">Dependencies</a>
            </li>
                      <li class="none">
                          <a href="dependency-convergence.html" title="Dependency Convergence">Dependency Convergence</a>
            </li>
                      <li class="none">
                          <a href="dependency-management.html" title="Dependency Management">Dependency Management</a>
            </li>
                      <li class="none">
                          <a href="dependency-info.html" title="Dependency Information">Dependency Information</a>
            </li>
                      <li class="none">
                          <a href="plugin-management.html" title="Plugin Management">Plugin Management</a>
            </li>
                      <li class="none">
                          <a href="plugins.html" title="Project Plugins">Project Plugins</a>
            </li>
              </ul>
        </li>
                                                                                                                                                                                                  <li class="collapsed">
                          <a href="project-reports.html" title="Project Reports">Project Reports</a>
                  </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                   
                    
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <div class="section">
<h2>TDD Exercise 6.3 - Persistence Layer (Data Access Objects)<a name="TDD_Exercise_6.3_-_Persistence_Layer_Data_Access_Objects"></a></h2>
<p>Ejemplo de programaci&#xf3;n de un Data Access Object usando TDD. Se crea una implementaci&#xf3;n de la interfaz AddressBookDao basada en JDBC.</p>
<ul>
<li>Ejemplo de uso de una base de datos embebida y en memoria para usar test de integraci&#xf3;n como test unitarios.</li></ul>
<ul>
<li>Implementaci&#xf3;n de la independencia entre los tests realizando un rollback al final de cada test.</li></ul>
<ul>
<li>Ejemplo de validaci&#xf3;n basada en el acceso directo a la base de datos en lugar del acceso a trav&#xe9;s del DAO bajo prueba.</li></ul>
<ul>
<li>Ejemplo de creaci&#xf3;n de Mock Parcial basado en la implementaci&#xf3;n de un <b>Delegation Pattern</b> que permite manipular las transacciones desde los tests (no se puede hacer con el spy de mockito).</li></ul>
<div class="section">
<h3>PROGRAMANDO DAOs CON TDD<a name="PROGRAMANDO_DAOs_CON_TDD"></a></h3>
<p>Siendo completamente rigurosos para programar verdaderos test unitarios de un objeto de estas caracter&#xed;sticas habr&#xed;a que independizar el c&#xf3;digo del acceso real a la base de datos, creando mocks del los objetos de la librer&#xed;a de acceso base de datos (mock de los objetos JDBC).</p>
<ul>
<li><b>NOTA</b>:
<p>En un ejercicio posterior se realizar&#xe1; una refactorizaci&#xf3;n de eliminaci&#xf3;n de c&#xf3;digo duplicado, que extrae, centraliza y hace reutilizable la mayor parte del c&#xf3;digo de JDBC.</p>
<p>Esta reutilizaci&#xf3;n del c&#xf3;digo permite realizar verdaderos test unitarios aislados de la base de datos, que garantizan una correcta utilizaci&#xf3;n y liberaci&#xf3;n de los recursos. Al estar centralizado y generalizado el c&#xf3;digo JDBC, estos test ya no necesitan aparecer en cada uno de los DAOs.</p></li></ul>
<p>Siendo completamente rigurosos cualquier test que no pueda independizarse del acceso a una base de datos se convierte en un <b>test de integraci&#xf3;n</b>, ya que el c&#xf3;digo est&#xe1; accediendo a un sistema externo (la base de datos).</p></div>
<div class="section">
<h3>MOCK BASE DE DATOS<a name="MOCK_BASE_DE_DATOS"></a></h3>
<p>En una primera aproximaci&#xf3;n (antes de disponer de la refactorizaci&#xf3;n que nos simplifica la creaci&#xf3;n de verdaderos test unitarios), se programar&#xe1;n tests basados en el acceso a un mock de la base de datos</p>
<p>Si las sentencias SQL utilizadas no son muy espec&#xed;ficas de un sistema de base de datos concreto y se usa un SQL gen&#xe9;rico, se puede utilizar un mock de una base de datos embebida o basada en memoria.</p>
<p>El mock es una base de datos embebida (y si se puede creada en memoria). Las tablas y campos necesarios se crean al inicio de la bater&#xed;a de test. No se crea el esquema completo, solo las tablas y campos usados por el DAO.</p></div>
<div class="section">
<h3>INDEPENDENCIA DE LOS TESTS (rollback)<a name="INDEPENDENCIA_DE_LOS_TESTS_rollback"></a></h3>
<p>Para mantener el principio <b>INDEPENDENT</b> de las propiedades <b>FIRST</b> se realiza un rollback de los cambios al finalizar cada test.</p>
<p>Esto tambi&#xe9;n permite que estos test puedan funcionar como test de integraci&#xf3;n contra la base de datos de desarrollo, ya que mantiene las tablas limpias de datos de test.</p>
<p>Para convertirlos en test de integraci&#xf3;n tan solo habr&#xed;a que eliminar del <i>class fixture</i> de creaci&#xf3;n de las tablas, y conectar con la base de datos de desarrollo.</p>
<p>El mantener la independencia no significa que siempre se comience cada test con una base de datos vac&#xed;a. Se puede crear un <i>fixture</i> en el <i>setUp</i> que inserte los datos comunes antes de cada test.</p></div>
<div class="section">
<h3>NOTAS SOBRE TEST DE INTEGRACI&#xd3;N<a name="NOTAS_SOBRE_TEST_DE_INTEGRACIN"></a></h3>
<p>Al igual que con los controladores de la capa de presentaci&#xf3;n, estas clases son muy repetitivas y simples. Dirigir el desarrollo a un nivel tan granular podr&#xed;a no aportar mucho. La implementaci&#xf3;n es muy directa y est&#xe1; condiciona por la tecnolog&#xed;a usada (JDBC). El desarrollo lo dirigir&#xe1; m&#xe1;s el framework (JDBC) que cualquier test unitario.</p>
<p>Una decisi&#xf3;n v&#xe1;lida ser&#xed;a obviar la programaci&#xf3;n de test unitarios, y tratarlos como test de integraci&#xf3;n contra la base de datos de desarrollo. Se programan exactamente igual, pero ya no se pueden utilizar f&#xe1;cilmente durante el bucle TDD ya que no cumplen bien las propiedades <b>FIRST</b>, ser&#xed;an lanzados en per&#xed;odos m&#xe1;s espaciados (en cada commit).</p>
<p>No obstante se puede seguir desarrollando con filosof&#xed;a Test First, aunque no se lancen los tests tan continuamente que usando TDD riguroso.</p>
<p><b>NOTA:</b></p>
<p>Se ver&#xe1; en un ejercicio posterior que mediante una buena refactorizaci&#xf3;n que elimine el c&#xf3;digo repetitivo se pueden crear test unitarios completamente aislados de la base de datos, que garantice por ejemplo la correcta gesti&#xf3;n y liberaci&#xf3;n de recursos.</p></div></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                    2010-2013
                        <a href="http://theprogrammingchronicles.com/">The Programming Chronicles</a>.
            All Rights Reserved.      
                    
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
