<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia at 25-abr-2011 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="es" lang="es">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>TDD Exercise 6.2 - Address Book Service - Database Implementation</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
      <meta name="author" content="Pedro Ballesteros pedro@theprogrammingchronicles.com" />
    <meta name="Date-Revision-yyyymmdd" content="20110425" />
    <meta http-equiv="Content-Language" content="es" />
                                                    
<meta content="no-cache, must-revalidate" http-equiv="Cache-Control"/>
                                                        
<meta content="nocache" http-equiv="Pragma"/>
                                                        
<meta content="-1" http-equiv="expires"/>
                      
  </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                TDD Exercise 6.2
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
            
        
                <div class="xleft">
        <span id="publishDate">Publicado el: 2011-04-25</span>
                  &nbsp;| <span id="projectVersion">Versión: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">        
        
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
             
        
                                <h5>Introducción</h5>
                  <ul>
                  <li class="none">
                          <a href="../../../index.html" title="Descripción">Descripción</a>
            </li>
                  <li class="none">
                          <a href="../../../project-summary.html" title="Proyecto">Proyecto</a>
            </li>
                  <li class="none">
                          <a href="../../../project-info.html" title="Información">Información</a>
            </li>
          </ul>
                       <h5>Proyecto padre</h5>
                  <ul>
                  <li class="none">
                          <a href="../index.html" title="TDD Lesson 6">TDD Lesson 6</a>
            </li>
          </ul>
                       <h5>Informes - Acceso rápido</h5>
                  <ul>
                  <li class="none">
                          <a href="../../../surefire-report.html" title="Tests Unitarios">Tests Unitarios</a>
            </li>
                  <li class="none">
                          <a href="../../../cobertura/index.html" title="Cobertura Tests">Cobertura Tests</a>
            </li>
                  <li class="none">
                          <a href="../../../apidocs/index.html" title="Java Doc">Java Doc</a>
            </li>
                  <li class="none">
                          <a href="../../../testapidocs/index.html" title="Test Java Doc">Test Java Doc</a>
            </li>
          </ul>
                       <h5>Documentación del proyecto</h5>
                  <ul>
                                                                                                                                                                                                                              <li class="expanded">
                          <a href="project-info.html" title="Información del proyecto">Información del proyecto</a>
                    <ul>
                      <li class="none">
            <strong>Bienvenido a</strong>
          </li>
                      <li class="none">
                          <a href="dependency-convergence.html" title="Convergencia de Dependencias">Convergencia de Dependencias</a>
            </li>
                      <li class="none">
                          <a href="dependencies.html" title="Dependencias">Dependencias</a>
            </li>
                      <li class="none">
                          <a href="team-list.html" title="Equipo del Proyecto">Equipo del Proyecto</a>
            </li>
                      <li class="none">
                          <a href="dependency-management.html" title="Gestión de Dependencias">Gestión de Dependencias</a>
            </li>
                      <li class="none">
                          <a href="plugin-management.html" title="Gestión de Plugins">Gestión de Plugins</a>
            </li>
                      <li class="none">
                          <a href="license.html" title="Licencia del Proyecto">Licencia del Proyecto</a>
            </li>
                      <li class="none">
                          <a href="plugins.html" title="Plugins del Proyecto">Plugins del Proyecto</a>
            </li>
                      <li class="none">
                          <a href="project-summary.html" title="Resumen del Proyecto">Resumen del Proyecto</a>
            </li>
              </ul>
        </li>
                                                                                                                                                                                                                    <li class="collapsed">
                          <a href="project-reports.html" title="Informes del proyecto">Informes del proyecto</a>
                  </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Generado por Maven" class="poweredBy">
        <img class="poweredBy" alt="Generado por Maven" src="./images/logos/maven-feather.png" />
      </a>
                   
        
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <div class="section"><h2>TDD Exercise 6.2 - Address Book Service - Database Implementation<a name="TDD_Exercise_6.2_-_Address_Book_Service_-_Database_Implementation"></a></h2><p>Creaci&#xf3;n de una implementaci&#xf3;n de GlobalAddressBook basada en el acceso a los DAOs de la capa de presentaci&#xf3;n.</p><ul><li>Se completa la funcionalidad de DbAddressBook copiando tests ya disponibles desde MemAddressBook, y refactorizando la implementaci&#xf3;n actual para basarla en el acceso a un AddressBookDao. Tambi&#xe9;n aparecen nuevos tests.</li></ul><ul><li>Se requiere la utilizaci&#xf3;n de stubs / mocks para aislar los test de la implementaci&#xf3;n real del AddressBook Dao y del acceso a la base de datos. De hecho la implementaci&#xf3;n del DAO aun no est&#xe1; disponible.</li></ul><ul><li>Los test solo sirven para validar el c&#xf3;digo existente en DbAddressBook, no para validar el c&#xf3;digo de acceso a la Base de Datos, responsabilidad del AddressBookDao que tendr&#xe1; sus propios tests.</li></ul><div class="section"><h3><b>VERIFICACI&#xd3;N ESTADO (STUB) O INTERACCI&#xd3;N (MOCK)</b><a name="VERIFICACIN_ESTADO_STUB_O_INTERACCIN_MOCK"></a></h3><p>Se debe evitar siempre que se pueda la <i>verificaci&#xf3;n por interacci&#xf3;n</i>. Los test no se deben convertir en una verificaci&#xf3;n rigurosa de que DbAddressBook llama o no llama a los m&#xe9;todos de AddressBookDao.</p><p>El objetivo principal es verificar el c&#xf3;digo o l&#xf3;gica del Object Under Test. De hecho los m&#xe9;todos que son una delegaci&#xf3;n directa sin l&#xf3;gica de negocio se podr&#xed;an dejar sin test, ya que dicho test no ayuda mucho a dirigir el desarrollo, y unos test de integraci&#xf3;n de nivel superior realizar&#xe1;n la validaci&#xf3;n mucho mejor y sin usar mocks.</p><p>En este caso el <b>verify</b> de un mock deber&#xed;a servir solo como sustituto de un <b>assert</b>. Usando la dependencia real el <b>assert</b> nos permite validar el resultado, usando un mock el resultado final ser&#xe1; una llamada a un objeto que no tenemos, por tanto se comprobar&#xe1; con un <b>verify</b>.</p><p>Se deben evitar los <b>verify</b> redundantes, y tener cuidado con los que verifican la falta de interacci&#xf3;n ya que hacen el test inflexible a futuros cambios y refactorizaciones.</p><p><b>VER</b>: <br />Basic kinds of interactions: <b>asking an object of data</b> and <b>telling an object to do something.</b></p><p><a class="externalLink" href="http://monkeyisland.pl/2008/04/26/asking-and-telling/">http://monkeyisland.pl/2008/04/26/asking-and-telling/</a></p><p><a class="externalLink" href="http://codebetter.com/blogs/aaron.jensen/archive/2008/04/03/separate-stub-and-verify-duplicate-code-necessarily.aspx">http://codebetter.com/blogs/aaron.jensen/archive/2008/04/03/separate-stub-and-verify-duplicate-code-necessarily.aspx</a></p></div><div class="section"><h3>RESUMEN<a name="RESUMEN"></a></h3><ul><li>Cambiando validaci&#xf3;n de interacci&#xf3;n por validaci&#xf3;n de estado, evitando validaciones redundantes. Usando llamadas programadas (stub) en lugar de verificaci&#xf3;n por interacci&#xf3;n.<p>Donde sea posible la programaci&#xf3;n de la respuesta del stub del DAO simula datos disponibles en la base de datos (no disponible).</p></li><li>Verificaci&#xf3;n por interacci&#xf3;n: matching de argumentos o captura de de argumentos. Verificaci&#xf3;n del resultado mediante el matching de los datos usados en la interacci&#xf3;n.</li></ul><ul><li>Implementaci&#xf3;n de funcionalidad adicional para facilitar el matching de argumentos y la verificaci&#xf3;n de datos.<p>La implementaci&#xf3;n de un m&#xe9;todo <b>Contact#equals</b> facilitar&#xed;a la comparaci&#xf3;n de contactos y el uso de los matching de argumentos.</p></li><li>Introducci&#xf3;n a los <a class="externalLink" href="http://code.google.com/p/hamcrest/">Hamcrest Matchers</a> (Java, C++, Objective-C, Python and PHP).<p>En el siguiente ejercicio 6.4 se mostrar&#xe1; un ejemplo de c&#xf3;mo simplificar tests mediante la creaci&#xf3;n de custom matchers (<b>assertThat</b>).</p></li><li>Se detectan fallos en la implementaci&#xf3;n anterior de la l&#xf3;gica de negocio.<p>La l&#xf3;gica de negocio se ha copiado de MemAddressBook, y los test muestran mediante su fallo que el uso de una base de datos ahora requiere adaptar no solo la delegaci&#xf3;n en el DAO si no tambi&#xe9;n l&#xf3;gica ya existente.</p><p><i>Ej.</i> En esta implementaci&#xf3;n no podemos asumir que los nombres y apellidos siempre est&#xe1;n almacenados sin espacios, como se asum&#xed;a en la implementaci&#xf3;n basada en memoria.</p><p><b>Lo mejor es que esta necesidad la han detectado los test unitarios que ya ten&#xed;amos de forma autom&#xe1;tica</b>.</p></li><li>Test unitarios para m&#xe9;todos de delegaci&#xf3;n directa.<p>En estos casos el test unitario tan solo valida que la implementaci&#xf3;n se delega completamente en la dependencia. Realmente no ayuda mucho a dirigir el desarrollo.</p><p><i>&#xbf;Es necesario tener test unitarios de este tipo de m&#xe9;todos?</i></p><p>Si disponemos de una bater&#xed;a de test de integraci&#xf3;n de m&#xe1;s alto nivel no ser&#xed;a muy necesario, los test de integraci&#xf3;n validar&#xe1;n este tipo de c&#xf3;digo de forma m&#xe1;s clara. Los fallos ser&#xe1;n f&#xe1;ciles de detectar aunque sean test de integraci&#xf3;n debido a la simplicidad de una delegaci&#xf3;n directa (sin l&#xf3;gica de negocio).</p></li></ul></div></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">Copyright &#169;                    2010-2011
                        <a href="http://theprogrammingchronicles.com/">The Programming Chronicles</a>.
            All Rights Reserved.      
        
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
