<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia at 25-abr-2011 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="es" lang="es">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>TDD Exercise 6.5 - Refactoring DAOs (Template Design Pattern)</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
      <meta name="author" content="Pedro Ballesteros pedro@theprogrammingchronicles.com" />
    <meta name="Date-Revision-yyyymmdd" content="20110425" />
    <meta http-equiv="Content-Language" content="es" />
                                                    
<meta content="no-cache, must-revalidate" http-equiv="Cache-Control"/>
                                                        
<meta content="nocache" http-equiv="Pragma"/>
                                                        
<meta content="-1" http-equiv="expires"/>
                      
  </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                TDD Exercise 6.5
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
            
        
                <div class="xleft">
        <span id="publishDate">Publicado el: 2011-04-25</span>
                  &nbsp;| <span id="projectVersion">Versión: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">        
        
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
             
        
                                <h5>Introducción</h5>
                  <ul>
                  <li class="none">
                          <a href="../../index.html" title="Descripción">Descripción</a>
            </li>
                  <li class="none">
                          <a href="../../project-summary.html" title="Proyecto">Proyecto</a>
            </li>
                  <li class="none">
                          <a href="../../project-info.html" title="Información">Información</a>
            </li>
          </ul>
                       <h5>Proyecto padre</h5>
                  <ul>
                  <li class="none">
                          <a href="../index.html" title="TDD Lesson 6">TDD Lesson 6</a>
            </li>
          </ul>
                       <h5>Informes - Acceso rápido</h5>
                  <ul>
                  <li class="none">
                          <a href="../../surefire-report.html" title="Tests Unitarios">Tests Unitarios</a>
            </li>
                  <li class="none">
                          <a href="../../cobertura/index.html" title="Cobertura Tests">Cobertura Tests</a>
            </li>
                  <li class="none">
                          <a href="../../apidocs/index.html" title="Java Doc">Java Doc</a>
            </li>
                  <li class="none">
                          <a href="../../testapidocs/index.html" title="Test Java Doc">Test Java Doc</a>
            </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Generado por Maven" class="poweredBy">
        <img class="poweredBy" alt="Generado por Maven" src="./images/logos/maven-feather.png" />
      </a>
                   
        
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <div class="section"><h2>TDD Exercise 6.5 - Refactoring DAOs (Template Design Pattern)<a name="TDD_Exercise_6.5_-_Refactoring_DAOs_Template_Design_Pattern"></a></h2><ul><li>Ejemplo de refactorizaci&#xf3;n mediante el <b>Template Design Pattern</b>, que entre otras muchas ventajas simplifica y robustece el testing unitario.</li></ul><ul><li>M&#xe1;s ejemplos de cuando es apropiada la validaci&#xf3;n por interacci&#xf3;n y la validaci&#xf3;n por estado (<b>TestJdbcDaoTemplate</b>).</li></ul><div class="section"><h3>REFACTORIZACI&#xd3;N<a name="REFACTORIZACIN"></a></h3><p>Refactorizaci&#xf3;n en el DAO del c&#xf3;digo de manipulaci&#xf3;n de objetos de la librer&#xed;a de acceso a base de datos (JDBC), para la eliminaci&#xf3;n de c&#xf3;digo repetitivo y su generalizaci&#xf3;n. Lo que proporciona un c&#xf3;digo que ser&#xe1; completamente reutilizable en otros DAOs.</p><p>La eliminaci&#xf3;n del c&#xf3;digo repetido se basa en el <b>Template Design Pattern</b>, que es &#xfa;til cuando varios m&#xe9;todos solo difieren en unas pocas l&#xed;neas internas, permitiendo extraer el c&#xf3;digo repetitivo que rodea dicho c&#xf3;digo.</p><p>El patr&#xf3;n <b>template</b> permite modificar el comportamiento de un c&#xf3;digo de plantilla mediante la entrega de callbacks que se ejecutan en puntos concretos de la plantilla.</p><p>En el ejemplo el DAO reduce el c&#xf3;digo en unas 50 l&#xed;neas adem&#xe1;s de proporcionar las siguientes ventajas:</p><ul><li>El c&#xf3;digo de los DAO ahora tiene <b>menos responsabilidades</b> extra&#xed;das mediante la aplicaci&#xf3;n del principio <b>SRP</b> de <b>SOLID</b>.</li></ul><ul><li><b>Los tests de los DAOs se simplifican</b> ya que deben probar menos responsabilidades (extra&#xed;das en el c&#xf3;digo del template), que ahora ser&#xe1; el encargado de validar dichas responsabilidades.</li></ul><ul><li>Los templates centralizan un c&#xf3;digo gen&#xe9;rico de manipulaci&#xf3;n de objetos de la librer&#xed;a de acceso a base de datos que suele ser muy propenso a errores por descuidos.</li></ul><ul><li>Los test de los templates pueden ser m&#xe1;s rigurosos validando la gesti&#xf3;n y cierre de recursos de la base de datos. Estos test ya no se deben repetir en todos los DAOs.</li></ul><ul><li>Al estar centralizado el acceso a la base de datos en un solo punto reutilizable por todos los DAOs, se pueden realizar <b>Test Unitarios Verdaderamente Aislados</b> sin necesidad de acceder a una base de datos (real, embebida o en memoria). Es m&#xe1;s sencillo basar los tests en la creaci&#xf3;n de stubs y mocks.</li></ul><ul><li>El c&#xf3;didigo resultante es m&#xe1;s robusto y menos propenso a errores, aseguramos de que todos los DAOs realizar&#xe1;n una gesti&#xf3;n correcta y liberaci&#xf3;n de los recursos de acceso a la base de datos. Ya no es su responsabilidad, el template es el &#xfa;nico encargado de liberar y crear estos recursos.</li></ul><ul><li>La creaci&#xf3;n de nuevos DAOS ser&#xe1; bastante m&#xe1;s sencilla, menos propensa a errores, y con mucho menos c&#xf3;digo.</li></ul><p><b>NOTA:</b> Existen librer&#xed;as que ya proporcionan este tipo de templates para el caso de JDBC, como <i>JDBC Spring Templates</i>.</p></div></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">Copyright &#169;                    2010-2011
                        <a href="http://theprogrammingchronicles.com/">The Programming Chronicles</a>.
            All Rights Reserved.      
        
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
