<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia at 25-abr-2011 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="es" lang="es">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>TDD Exercise 7.1 - Visual Integration Tests - Creating Views</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
      <meta name="author" content="Pedro Ballesteros pedro@theprogrammingchronicles.com" />
    <meta name="Date-Revision-yyyymmdd" content="20110425" />
    <meta http-equiv="Content-Language" content="es" />
                                                    
<meta content="no-cache, must-revalidate" http-equiv="Cache-Control"/>
                                                        
<meta content="nocache" http-equiv="Pragma"/>
                                                        
<meta content="-1" http-equiv="expires"/>
                      
  </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                TDD Exercise 7.1
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
            
        
                <div class="xleft">
        <span id="publishDate">Publicado el: 2011-04-25</span>
                  &nbsp;| <span id="projectVersion">Versión: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">        
        
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
             
        
                                <h5>Introducción</h5>
                  <ul>
                  <li class="none">
                          <a href="../../index.html" title="Descripción">Descripción</a>
            </li>
                  <li class="none">
                          <a href="../../project-summary.html" title="Proyecto">Proyecto</a>
            </li>
                  <li class="none">
                          <a href="../../project-info.html" title="Información">Información</a>
            </li>
          </ul>
                       <h5>Proyecto padre</h5>
                  <ul>
                  <li class="none">
                          <a href="../index.html" title="TDD Lesson 7">TDD Lesson 7</a>
            </li>
          </ul>
                       <h5>Informes - Acceso rápido</h5>
                  <ul>
                  <li class="none">
                          <a href="../../surefire-report.html" title="Tests Unitarios">Tests Unitarios</a>
            </li>
                  <li class="none">
                          <a href="../../cobertura/index.html" title="Cobertura Tests">Cobertura Tests</a>
            </li>
                  <li class="none">
                          <a href="../../apidocs/index.html" title="Java Doc">Java Doc</a>
            </li>
                  <li class="none">
                          <a href="../../testapidocs/index.html" title="Test Java Doc">Test Java Doc</a>
            </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Generado por Maven" class="poweredBy">
        <img class="poweredBy" alt="Generado por Maven" src="./images/logos/maven-feather.png" />
      </a>
                   
        
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <div class="section"><h2>TDD Exercise 7.1 - Visual Integration Tests - Creating Views<a name="TDD_Exercise_7.1_-_Visual_Integration_Tests_-_Creating_Views"></a></h2><p>Desarrollo de la parte cliente de la capa de presentaci&#xf3;n (vistas con JSP sin l&#xf3;gica)</p><p>El desarrollo de las vistas muestra nuevas necesidades de c&#xf3;digo funcional en los controladores. Toda la l&#xf3;gica adicional se desarrolla como siempre usando TDD con tests unitarios aislados.</p><p>Al abordar el despliegue, configuraci&#xf3;n e integraci&#xf3;n de nuestra aplicaci&#xf3;n vemos que falta c&#xf3;digo ejecutable por implementar.</p><ul><li>Este c&#xf3;digo por supuesto se desarrolla usando TDD.</li><li>Todo c&#xf3;digo ejecutable siempre tendr&#xe1; al menos las pruebas unitarias que dirigieron su codificaci&#xf3;n.</li></ul><div class="section"><h3>NOTAS SOBRE LA INTEGRACION<a name="NOTAS_SOBRE_LA_INTEGRACION"></a></h3><p>Hasta ahora ten&#xed;amos un sistema que &quot;parece&quot; correcto a nivel de pruebas unitarias. &#xbf;Pero asegura esto que todo funciona al 100%?</p><p>Despues de implementar las vistas y la la nueva funcionalidad de configuraci&#xf3;n de vistas en controladores, todo parece funcionar correctamente. </p><p>Pero si intentamos a&#xf1;adir contactos duplicados, la Interfaz de Usuario no reporta correctamente los errores (pantalla demasiado gen&#xe9;rica).</p><ul><li><p>Los tests unitarios no han mostrado fallos ocultos. Es decir, en este caso el test visual de UI nos ha mostrado informaci&#xf3;n que los tests unitarios no estaban mostrando.</p></li><li><p>Aunque en este caso el fallo se debe a que se nos olvid&#xf3; codificar parte de las pruebas de aceptaci&#xf3;n en los controladores (capa de presentaci&#xf3;n).</p></li><li><p>Esto se habr&#xed;a evitado si la implementaci&#xf3;n de la l&#xf3;gica de presentaci&#xf3;n, de los controladores, hubieramos dirigido los tests unitarios usando los tests de aceptaci&#xf3;n al igual que hicimos con la logica de negocio.</p><p>Este es un ejemplo de que aunque controlemos fallos en capas internas mediante tests unitarios, los mismos fallos podr&#xed;an tener que controlarse en capas superiores, y por tanto aparecer en los tests.</p></li></ul><p>Los tests de integraci&#xf3;n, tests de sistema y tests de interfaz de usuario siguen siendo necesarios al margen del uso de TDD.</p><p>No obstante con TDD vamos a conseguir que el n&#xfa;mero de defectos en la integraci&#xf3;n sea menor (y por tanto el esfuerzo para solucionarlos).</p><p>Los tests mencionados, en teor&#xed;a est&#xe1;n fuera del bucle incremental de TDD (recordatorio de la teor&#xed;a).</p><p>El problema principal es que los tests de este tipo necesitan un soporte extra especifico de la tecnolog&#xed;a utilizada. En Java por ejemplo hay varias herramientas disponibles (al margen de herramientas especificas para Web UIs como Seleniun).</p><p>Tambi&#xe9;n suelen ser demasiado lentos para TDD. Se recuerda que en TDD necesitamos lanzar las pruebas cada pocos minutos para programar incrementalmente. No es raro ver que un d&#xed;a los hemos lanzado los tests hasta unas 200 veces.</p><p>Tambi&#xe9;n son tests m&#xe1;s complejos, est&#xe1;n mas separados del c&#xf3;digo, son m&#xe1;s sensibles a cambios de requisitos, etc. Por lo que al final requerir&#xe1;n esfuerzos extras de mantenimiento (unos esfuerzos que en TDD pasan desapercibidos ya que surgen de forma natural).</p></div></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">Copyright &#169;                    2010-2011
                        <a href="http://theprogrammingchronicles.com/">The Programming Chronicles</a>.
            All Rights Reserved.      
        
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
